{ "name": "LottieEmbed",
  "memberOf": "$w",
  "mixes":
    [ "$w.Element",
      "$w.FocusMixin",
      "$w.HiddenCollapsedMixin",
      "$w.ClickableMixin" ],
  "labels":
    [ "new" ],
  "location":
    { "lineno": 1,
      "filename": "LottieEmbed.js" },
  "docs":
    { "summary": "LottieEmbed is used for embedding and customizing a Lottie animation.",
      "description":
        [ "[Lottie embed](https://support.wix.com/en/article/adding-and-setting-up-ellipsis-text) allows you to embed and customize your [Lottie](https://airbnb.design/lottie/) animation. First",
          "the Lottie Embeds",
          "![Collapsible Text](images/collapsible_text.png \"Collapsible Text\")",
          "",
          "### Set Up Your Collapsible Text ",
          "+ Set the text of the collapsible text element using the [`text`](#text) property. ",
          "+ Set the maximum number of initial lines of text that you would like to display in the collapsible text, using the [`maxLines`](#maxlines) property. This is how you divide the introductory text and the remaining text in the collapsible text.",
          "+ The introductory text is accompanied by an ellipsis to signal to the site visitor that there is additional text. ",
          "+ By default, the [`ellipsisEnabled`](#ellipsisenabled) property is `true`, and the ellipsis functionality for the collapsible text is turned on. In this case, the ellipsis is shown, and the collapsible text displays the introductory text until a site visitor performs an action to read more and display the remaining text. ",
          "+ If the `ellipsisEnabled` property is `false`, the ellipsis functionality for the collapsible text is turned off. In this case, the ellipsis is hidden, and the collapsible text displays the full text and acts as a regular text element.",
          "+ To turn off the ellipsis functionality, use the [`disableEllipsis()`](#disableellipsis) function. Turning off the ellipsis functionality sets the `ellipsisEnabled` property to `false`.",
          "+ To turn on the ellipsis functionality, use the [`enableEllipsis()`](#enableellipsis) function. Turning on the ellipsis functionality sets the `ellipsisEnabled` property to `true`." ],
      "links": [],
      "examples": [],
      "extra":
        {  } },
  "properties": [],
  "operations": [],
  "callbacks": [],
  "messages": [],
  "extra":
    { "queryable": true } }