{ "name": "CustomClassListToo",
  "memberOf": "$w",
  "mixes": [],
  "labels":
    [ "new" ],
  "location":
    { "lineno": 1,
      "filename": "CustomClassList.js" },
  "docs":
    { "summary": "Provides functionality for manipulating custom CSS classes.",
      "description":
        [ "> This property is not TESTING yet available to all users.",
          "",
          "CustomClassList is a mixin that provides functionality for manipulating an element's custom CSS classes. For example, ",
          "you can add a custom class to an element or replace an existing class with a new custom class.",
          "",
          "Custom classes are those that you define for your site, not the predefined global classes",
          "that are provided for each element.  ",
          "",
          "You define custom CSS classes in the `global.css` file which can be accessed in the Page Code section of the Editor. For more information on defining custom classes, ",
          "see [Add CSS to your site](https://www.wix.com/velo/reference/$w/styling-elements-with-css#$w_styling-elements-with-css_add-css-to-your-site) ",
          "and [About CSS editing](https://support.wix.com/en/article/editor-x-about-css-editing). ",
          "",
          "> **Note:** This mixin is currently only available in Wix Studio.  ",
          " ",
          "**About Mixins**",
          "",
          "Mixins provide functionality that other elements can inherit and use. ",
          " ",
          "Mixins are not elements. You cannot add mixins to a page in the Editor like other `$w` elements, and mixins are not meant to be used directly ",
          "in your code. ",
          "For example, you would not write code like this, because it is out of context:",
          "",
          "```js",
          "let myClasses = $w(\"#CustomClassList\").customClassList.values();",
          "```",
          "",
          "Instead, you can code the following if myElement is an element that \"mixes in\" CustomClassList mixin.",
          "",
          "```js",
          "let myClasses = $w(\"#myElement\").customClassList.values();",
          "```",
          "",
          "> **Note:** This mixin only affects custom classes. If you use it for global classes, there is no effect on the element." ],
      "links": [],
      "examples": [],
      "extra":
        {  } },
  "properties": [],
  "operations": [],
  "callbacks": [],
  "messages": [],
  "extra":
    {  } }