{ "name": "wix-web-module",
  "mixes": [],
  "labels":
    [ "changed" ],
  "location":
    { "lineno": 1,
      "filename": "web-methods.js" },
  "docs":
    { "summary": "The wix-web-module module contains functionality for defining and managing web modules.",
      "description":
        [ "The Web Modules API allows you to define functions in your backend code that can be called from your site's frontend code. In order to call the function from the frontened, you need to define the necessary permissions. ",
          "",
          "With Web Modules you can also choose to cache the HTTP responses of functions in your code. This means you can temporarily store the result of the function in a cache memory for a specific period of time. Caching HTTP responses helps reduce response times, decrease server load, and enhance the overall user experience of site visitors by providing quicker access to previously generated data.",
          "",
          "To use the Web Modules API, import the `webMethod` function and the `Permissions` enum from the `wix-web-module` module:",
          "```javascript",
          "import { webMethod, Permissions } from 'wix-web-module';",
          "```",
          "Learn more about [working with the Web Modules API](https://support.wix.com/en/article/about-web-methods)." ],
      "links": [],
      "examples": [],
      "extra":
        {  } },
  "properties": [],
  "operations":
    [ { "name": "webMethod",
        "labels": [],
        "nameParams": [],
        "params":
          [ { "name": "permissions",
              "type": "wix-web-modules.Permissions",
              "doc": "Permissions needed to call the function in frontend code." },
            { "name": "function",
              "type": "Function",
              "doc": "Function to export." },
            { "name": "options",
              "type": "wix-web-module.Options",
              "doc": "Web module options for caching.",
              "optional": true } ],
        "ret":
          { "type":
              { "name": "Promise",
                "typeParams":
                  [ "function()" ] } },
        "locations":
          [ { "lineno": 19,
              "filename": "web-methods.js" } ],
        "docs":
          { "summary": "Defines a backend function that can be called from the frontend.",
            "description":
              [ "The `webMethod()` function is a wrapper used to export functions from backend code that can be called from the frontend. ",
                "",
                "The `permissions` parameter is used to define the permissions needed to call the function in frontend code. Import",
                "the `Permissions` enum from the `wix-web-module` module to define the permissions. ",
                "The permission options are:",
                " - `Permissions.Anyone`: Any site visitor can call the function.",
                " - `Permissions.Admin`: Only site admins can call the function.",
                " - `Permissions.SiteMember`: Only site members can call the function.",
                "",
                "",
                "The `cache` paramater, found within the `options` object, enables you to cache or temporarily store the responses of your backend functions for a specific duration. This enhances performance by storing results and reusing them for subsequent calls within the cache time limit. Use the `ttl` (time to live) property to define the duration, in seconds, for which you want your response to be cached. If the time to live is not set, the default value is '60400' seconds (approximately 1 week). Setting a limited cache time is beneficial in scenarios where the data being returned is subject to fequent updates, ensuring that your site consistently retrieves the most current data from the backend. ",
                "",
                "",
                "You can also give a cached response identifiers, using the `tags` property of the `cache` object. Tags allow you to designate specific cached responses that may require some invalidation or clearing at a later time. For example, consider a site that displays relatively static information, such as a list of employees. With the `webMethod()` wrapper, you can use a function to retrieve employee data from a collection, assign the response with a tag such as \"employees\", and set a monthly caching schedule. If a new employee is hired and added to the collection, you can use the [`invalidateCache()`]() function from `wix-cache-backend` to invalidate the response carrying the \"employees\" tag. This action clears the cache and prompts the retrieval of the updated employee data from the original collection, following which the new response will resume being cached on a monthly basis.",
                "",
                "Web methods must be defined in files with a `.web.js` extension." ],
            "links": [],
            "examples":
              [ { "title": "Export a backend function and use it in frontend code",
                  "body":
                    [ "// Exporting a backend function from a '.web.js' file:",
                      "import {Permissions, webMethod} from \"wix-web-module\";",
                      "",
                      "export const multiply = webMethod(Permissions.Anyone, (a,b) => a * b);",
                      "",
                      "// Using the function in frontend code:",
                      "import {multiply} from \"backend/multiply.web\";",
                      "",
                      "$w.onReady(async function () {",
                      "  multiply(5, 3).then((result) => {",
                      "    console.log(result); // Logs 15",
                      "  });",
                      "});" ],
                  "extra":
                    {  } } ],
            "extra":
              {  } },
        "extra":
          {  } } ],
  "callbacks": [],
  "messages":
    [ { "name": "Cache",
        "locations":
          [ { "lineno": 66,
              "filename": "web-methods.js" } ],
        "docs":
          { "summary": "Caching options.",
            "links": [],
            "examples": [],
            "extra":
              {  } },
        "members":
          [ { "name": "tags",
              "type":
                { "name": "Array",
                  "typeParams":
                    [ "string" ] },
              "doc": "An array of strings used to categorize and identify the caches responses. These tags help you organize and specify which cached date to invalidate later.",
              "optional": true },
            { "name": "ttl",
              "type": "number",
              "doc": "The time-to-live (TTL) for the caches response specified in seconds. This defines how long the cached response should be stored before expiring and being re-retrieved. \n\nDefault: 604000 seconds",
              "optional": true } ],
        "extra":
          {  },
        "labels": [] },
      { "name": "Options",
        "locations":
          [ { "lineno": 60,
              "filename": "web-methods.js" } ],
        "docs":
          { "summary": "An object representing caching options.",
            "links": [],
            "examples": [],
            "extra":
              {  } },
        "members":
          [ { "name": "cache",
              "type": "wix-web-module.Cache",
              "doc": "Options to cache the response of the `function` being passed.",
              "optional": true } ],
        "extra":
          {  },
        "labels": [] } ],
  "extra":
    { "scopes":
        [ "backend" ] } }